{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 8], "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "units": 100, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 100, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 32, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "use_bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}